{
    "introduction": {
        "summary": "A team focussed software developer with a learning and upskilling mindset, I am passionate in creating entire applications as well as supporting them through their lifetime. Currently I am working in the fullstack development space with React frontend applications and various backend applications. I have strong skills in AWS cloud applications with CI/CD deployments aiding them. I was introduced to the software side of technology throughout university where applying logic and reasoning to solve problems became an obvious passion. Being able to apply those same principals with a customer problem was the next step to this path. I embrace the opportunity to learn new technical and non-technical skills at every chance whether it be a new software framework or meeting new people"
    },
    "experience": {
        "items":[
            {
                "title": "Software Engineer",
                "companyInfo": "Melodics | 2021 - Present",
                "paragraph": "Primary Engineer in the Platform & Services team, I have built an integration with external services to manage the subscriptions platform at Melodics including frontend, backend and infrastructure. This is in addition to product feature work for any requirements for other teams as well as a fully automated analytics pipeline. Technologies used - PHP (Laravel), Typescript (Node + React), MySQL with many different AWS services"
            },
            {
                "title": "Technical Co-Founder",
                "companyInfo": "Tracked | 2020 - 2022",
                "paragraph": "Co-created a DJ web app and chrome extension that allows DJs to identify songs within Soundcloud, YouTube and Mixcloud sets and add them to centralised playlists - which can then be exported to other listening medium. The product was build with React, Golang, Postgres and hosted on AWS ECS + S3"
            },
            {
                "title": "Software Engineer",
                "companyInfo": "Xero | 2018 - 2021",
                "paragraph": "Contributing to the Xero HQ product as a full stack developer, I have worked in an eight person team managing staff authorisation. Throughout my time spent in the team, I have worked with entire applications through the decision making process, to the deployment pipelines, frontend + backend application and after hours on-call support. In addition to technical aspects, I have been a part of the tech + outreach team, Maori engagement team and a part of the recruitment process."
            },
            {
                "title": "Software Engineer Intern",
                "companyInfo": "Vend | 2017 - 2018",
                "paragraph": "As a part of this internship I was a part of a team creating a new service that would generate customisable receipts based on the users template. The product was built in Go on AWS with a React frontend."
            },
            {
                "title": "DevOps Intern",
                "companyInfo": "Koordinates | 2016 - 2017",
                "paragraph": "A problem that I was challenged with in this internship was to generate an application that could aggregate the logs generated by multiple applications and serve it in a scalable manner. I solved this with a Logstash, Elasticsearch and Kibana stack, using AWS to host the services."
            },
            {
                "title": "Software Engineer Tutor",
                "companyInfo": "Victoria University of Wellington | 2014 - 2017",
                "paragraph": "I spent three years during my degree in Wellington as a primary lab tutor teaching first, second and third year students software design and priciples as well as marking and giving feedback. This was done while balancing my heavy university workload."
            }
        ]
    },
    "interests": {
        "items":[ "Music", "Concerts & Gigs", "Technology & Gaming", "Television & Films", "Fitness & Health", "Travelling" ]
    },
    "education": {
        "university": "Victoria University of Wellington | 2014 - 2018",
        "degree": "BE (Hons) - Networking",
        "info": "Completed First Class honours in Network Engineering with additional Software Engineering courses, ending with an A- average. Final year project incorporated an internet of things beehive connected to the internet via 3G which communicated telemetry data including weight and temperature to an Elasticsearch + Kibana stack, surfaced the user with a simple hybrid mobile application"
    },
    "skills": {
        "technical": [
            "OO programming + design",
            "REST principles",
            "Database desgin (SQL Server, MySQL, Postgres, NoSQL)",
            "Programming Languages (Typescript, Javascript, C#, PHP, Golang)",
            "Frontend frameworks (React, Angular)",
            "Backend framworks (.NET, Node, Laravel)",
            "Scripting (Python, Powershell, Bash)",
            "CI/CD pipelines",
            "Cloud Infrastructure (AWS)"
        ],
        "professional": [
            "Team contributer",
            "Customer value focussed",
            "Growth + upskilling mindset",
            "Clear + upfront communication"
        ]
    },
    "awardscertifications": [
        {"company": "Amazon Web Services - 2019", "award":"Certified Developer Associate, Certified Solutions Architect Associate"},
        {"company": "Xero - 2018", "award":"Top Graduate of the year"},
        {"company": "Victoria University - 2017", "award":"Te Tini a Rehua Excellence Award (Top Maori Engineering Student)"},
        {"company": "Auckland Grammar School - 2014", "award":"Prefect"}
    ]
}
